import jsForKids from "../assets/images/jsForKids.png";

const books = [
  {
    id: 1,
    title: "JavaScript для детей",
    author: "Ник Морган",
    year: 2014,
    description:
      "Эта книга позволит вам погрузиться в программирование и с легкостью освоить JavaScript. Вы напишете несколько настоящих игр — поиск сокровищ на карте, «Виселицу»...",
    tags: ["Программирование", "Детская литература"],
    library: "Центральная городская библиотека им. Н.А. Некрасова",
    image: jsForKids,
    alt: "js for kids",
    numberOfLibraries: 1,
  },
  {
    id: 2,
    title: "Рефакторинг кода на JavaScript",
    author: "Фаулер Мартин",
    year: 2019,
    description:
      "Рефакторинг уже давно и прочно занимает достойное место среди технологий программирования, и не в последнюю очередь благодаря Мартину Фаулеру - автору одной из тех книг, которые...",
    tags: ["Программирование", "Детская литература"],
    library: "Центральная городская библиотека им. Н.А. Некрасова",
    image: jsForKids,
    alt: "js for kids",
    numberOfLibraries: 5,
  },
  {
    id: 3,
    title: "JavaScript с нуля до профи",
    author: "Свекис Лоренс Ларс, ван Путтен Майке, Персиваль Роб",
    year: 2019,
    description:
      "Книга демонстрирует возможности JavaScript для разработки веб-приложений, сочетая теорию с упражнениями и интересными проектами. Она показывает,...",
    tags: ["Программирование"],
    library: "Центральная городская библиотека им. Н.А. Некрасова",
    image: jsForKids,
    alt: "js for kids",
    numberOfLibraries: 7,
  },
  {
    id: 4,
    title: "Война и мир",
    author: "Лев Толстой",
    year: 1869,
    description:
      "Эпический роман о жизни русского общества в эпоху наполеоновских войн. Судьбы нескольких семей на фоне исторических событий.",
    tags: ["Классика", "Роман"],
    library: "Библиотека-читальня им. И.С. Тургенева",
    image: jsForKids,
    alt: "js for kids",
    numberOfLibraries: 3,
  },
  {
    id: 5,
    title: "Дюна",
    author: "Фрэнк Герберт",
    year: 1965,
    description:
      "Эпическая сага о пустынной планете Арракис, где добывают самую ценную субстанцию во Вселенной — спайс. История власти, религии и экологии.",
    tags: ["Фантастика", "Сага"],
    library: "Российская государственная библиотека (РГБ)",
    image: jsForKids,
    alt: "js for kids",
    numberOfLibraries: 2,
  },
  {
    id: 6,
    title: "Мастер и Маргарита",
    author: "Михаил Булгаков",
    year: 1967,
    description:
      "Мистический роман, в котором переплетаются судьбы писателя Мастера, его возлюбленной Маргариты и самого Воланда, посетившего Москву 1930-х годов.",
    tags: ["Мистика", "Сатира"],
    library: "Библиотека иностранной литературы им. М.И. Рудомино",
    image: jsForKids,
    alt: "js for kids",
    numberOfLibraries: 9,
  },
];

export default books;
